num = input("Введите число: ") 
A = ["один","два","три","четыре","пять","шесть","семь","восемь","девять"]
A1 = ["одна","две","три","четыре","пять","шесть","семь","восемь","девять"]
B = ["одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"]
C = ["десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"]
D = ["сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"]
D1 = ["тысяча", "тысячи", "тысяч"]
try: 
    num = int(num)
except:
    print("Не удовлетворяет данным условиям. Введите число")

else:
    num = int(num)
    #Определяем позиции цифр в числе
    num1 = num // 1000
    num2 = (num // 100) % 10
    num3 = (num // 10) % 10
    num4 = num % 10
    print("Ваше число в текством виде:", end='')

    if num1 != 0: #Четырыёхзначное число
        i = num1
        call1 = A1[i-1] #Вызывает из массива нужное название
        X = [2, 3, 4] #Если надо "тысячи"
        X1 = [5, 6, 7, 8, 9] #Если надо "тысяч"
        if i == 1: #Функция определяет какое необходимо название
            call1 = call1 + " " + D1[0]
        elif 2 <= i <= 4:
            call1 = call1 + " " + D1[1]
        else:
            call1 = call1 + " " + D1[2]
    else:
        call1 = ""

    if num2 != 0: 
        i = num2
        call2 = D[i-1]
    else:
        call2 = ""
    if num3 == 0:
        i = num4
        if num4 == 0:
            call5 = "рублей"
            print(call1, call2, call5)
        else:
            call3 = A[i-1]
            Z = [5, 6, 7, 8, 9]
            Z1 = [2, 3, 4]
            if 5 <= i <= 9:
                call5 = "рублей"
            elif 2 <= i <= 4:
                call5 = "рубля"
            else:
                call5 = "рубль"
            print(call1, call2,call3,call5)
    elif num3 == 1:
        i = num4
        call3 = B[i-1]
        print(call1,call2,call3,"рублей")
    else:
        i = num3
        call3 = C[i-1]
        i = num4
        call4 = A[i-1]
        if 5 <= i <= 9:
            call5 = "рублей"
        elif 2 <= i <= 4:
            call5 = "рубля"
        else:
            call5 = "рубль"
        print(call1,call2,call3,call4, call5)

    if (num4 !=0) and (num1 == 0) and (num2 == 0) and (num3 == 0):
        i = num4
        call4 = A[i-1]
        Z = [5, 6, 7, 8, 9]
        Z1 = [2, 3, 4]
        if num4 == Z:
            call5 = "рублей"
        elif num4 == Z1:
            call5 = "рубля"
        else:
            call5 = "рубль"
        print(call4, call5)



